In [29]:
import pandas as pd
from sklearn import linear_model

In [30]:
df=pd.read_csv("salary_fix.csv")
df

      exp  test_score  interview_score  Salary
0     NaN         8.0                9   50000
1     NaN         8.0                6   45000
2     two        10.0                7   60000
3    five         6.0               10   65000
4   seven         9.0                6   70000
5   three         7.0               10   62000
6     ten         NaN                7   72000
7  eleven         7.0                8   80000

In [31]:
df.exp=df.exp.fillna(0)

In [32]:
p=df.test_score.median()
df.test_score=df.test_score.fillna(p)

In [33]:
df

      exp  test_score  interview_score  Salary
0       0         8.0                9   50000
1       0         8.0                6   45000
2     two        10.0                7   60000
3    five         6.0               10   65000
4   seven         9.0                6   70000
5   three         7.0               10   62000
6     ten         8.0                7   72000
7  eleven         7.0                8   80000

In [35]:
from word2number import w2n
df["exp"]=df.exp.astype(str)
df["exp"]=df.exp.apply(w2n.word_to_num)
df

   exp  test_score  interview_score  Salary
0    0         8.0                9   50000
1    0         8.0                6   45000
2    2        10.0                7   60000
3    5         6.0               10   65000
4    7         9.0                6   70000
5    3         7.0               10   62000
6   10         8.0                7   72000
7   11         7.0                8   80000

In [37]:
reg=linear_model.LinearRegression()
reg=reg.fit(df[['exp','test_score','interview_score']],df.Salary)

In [45]:
s1= reg.predict([[2,9,6]])
s2= reg.predict([[12,10,10]])
print(s1,s2)

[53509.28765288] [95055.40869197]

C:\Anaconda\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(
C:\Anaconda\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

In [40]:
reg.coef_

array([2851.15082302, 2798.38567551, 2559.05678334])

In [41]:
reg.intercept_

7267.174227203795